//#include<bits/stdc++.h>
//using namespace std;
//
//int main()
//{
//	//----------按位取反----------
//	//使一个数的最低位为0
//	int a = 7;
//	cout << (a & ~1) << endl;	//7为0111 1取反后为1110 两个数在按位与得0110
//
//	//----------按位与----------
//	//清零
//	int b = 100;
//	cout << (b & 0) << endl;
//
//	//取一个数的指定位
//	int c = 253;
//	cout << (c & 15) << endl;	//253为1111 1101 15为0000 1111，可以得到253的低四位
//
//	//判断奇偶
//	int d = 15;
//	int e = 4;
//	cout << (d & 1) << endl;
//	cout << (e & 1) << endl;
//
//	//----------按位或----------
//	//将某数的某些位置为1
//	int f = 240;
//	cout << (f | 15) << endl;	//将240的低四位置为1
//
//	//----------按位异或----------
//	//反转指定位
//	int g = 17;
//	cout << (g ^ 15) << endl;	//17为0001 0001 将低四位反转得0001 1110为30
//
//	//交换两个数
//	int x = 19;
//	int y = 100;
//	x ^= y;
//	y ^= x;
//	x ^= y;
//	cout << x << endl << y << endl;
//
//	system("pause");
//	return 0;
//}